In [2]:
import pandas as pd

In [3]:
df_sp500 = pd.read_csv('data/SP500.csv')
df_sp500

            DATE    SP500
0     2013-12-09  1808.37
1     2013-12-10  1802.62
2     2013-12-11  1782.22
3     2013-12-12  1775.50
4     2013-12-13  1775.32
...          ...      ...
2603  2023-11-30   4567.8
2604  2023-12-01  4594.63
2605  2023-12-04  4569.78
2606  2023-12-05  4567.18
2607  2023-12-06  4549.34

[2608 rows x 2 columns]

In [4]:
df_sp500.sort_values(by='DATE', ascending=True)

            DATE    SP500
0     2013-12-09  1808.37
1     2013-12-10  1802.62
2     2013-12-11  1782.22
3     2013-12-12  1775.50
4     2013-12-13  1775.32
...          ...      ...
2603  2023-11-30   4567.8
2604  2023-12-01  4594.63
2605  2023-12-04  4569.78
2606  2023-12-05  4567.18
2607  2023-12-06  4549.34

[2608 rows x 2 columns]

In [10]:
df_sp500[df_sp500['DATE'] > '2023-12-01']

            DATE    SP500
2605  2023-12-04  4569.78
2606  2023-12-05  4567.18
2607  2023-12-06  4549.34